# Ultralytics YOLO 🚀, GPL-3.0 license
# StarYOLO: YOLOv8 backbone with StarBlock, SimpleStem, VisionClueMerge

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# StarYOLO backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]     # 0-P2/4
  - [-1, 3, StarBlock, [128]]         # 1
  - [-1, 3, StarBlock, [128]]
  - [-1, 1, VisionClueMerge, [256]]   # 2-P3/8
  - [-1, 3, StarBlock, [256]]         # 3
  - [-1, 1, VisionClueMerge, [512]]   # 4-P4/16
  - [-1, 9, StarBlock, [512]]         # 5
  - [-1, 1, VisionClueMerge, [1024]]  # 6-P5/32
  - [-1, 3, StarBlock, [1024]]        # 7
  - [-1, 1, SPPF, [1024, 5]]          # 9

# YOLOv8.0n head (unchanged)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]        # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P5
  - [-1, 3, C2f, [1024]]       # 21 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]  # Detect(P3, P4, P5)
